profiling/results/stage-4_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.090ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.982ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.08ms    1.71ms  25.34ms   93.74%
    Req/Sec   529.47    128.49     1.55k    81.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.74ms
 75.000%    2.33ms
 90.000%    3.08ms
 99.000%   10.37ms
 99.900%   17.97ms
 99.990%   22.78ms
 99.999%   25.36ms
100.000%   25.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.214     0.000000            1         0.00
       0.895     0.100000         5012 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.145     0.200000         9996         0.00
       1.352     0.300000        15001        -0.00
       1.543     0.400000        19997        -0.00
       1.736     0.500000        24991         0.00
       1.836     0.550000        27482 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.943     0.600000        30006         0.00
       2.059     0.650000        32518        -0.00
       2.183     0.700000        34971        -0.00
       2.325     0.750000        37485         0.00
       2.409     0.775000        38729 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.497     0.800000        39978         0.00
       2.593     0.825000        41224        -0.00
       2.709     0.850000        42477        -0.00
       2.867     0.875000        43723         0.00
       2.965     0.887500        44347 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.075     0.900000        44963         0.00
       3.211     0.912500        45586        -0.00
       3.411     0.925000        46214        -0.00
       3.727     0.937500        46836         0.00
       3.983     0.943750        47148 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.331     0.950000        47461         -nan
       4.763     0.956250        47772        -0.00
       5.375     0.962500        48084        -0.00
       6.127     0.968750        48397         0.00
       6.475     0.971875        48552 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       6.979     0.975000        48710         -nan
       7.519     0.978125        48865        -0.00
       8.071     0.981250        49021        -0.00
       8.815     0.984375        49177         0.00
       9.199     0.985938        49255 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       9.559     0.987500        49333         0.00
       9.999     0.989062        49411        -0.00
      10.599     0.990625        49490        -0.00
      11.239     0.992188        49568         0.00
      11.527     0.992969        49606 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      11.967     0.993750        49645         0.00
      12.479     0.994531        49684        -0.00
      13.015     0.995313        49723        -0.00
      13.703     0.996094        49762         0.00
      13.959     0.996484        49783 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      14.239     0.996875        49802         -nan
      14.679     0.997266        49821        -0.00
      15.063     0.997656        49840        -0.00
      15.487     0.998047        49860         0.00
      16.119     0.998242        49871 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      16.431     0.998437        49880         -nan
      16.975     0.998633        49889        -0.00
      17.471     0.998828        49899        -0.00
      18.095     0.999023        49909         0.00
      18.351     0.999121        49914 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      18.463     0.999219        49918         0.00
      18.767     0.999316        49923        -0.00
      19.327     0.999414        49928        -0.00
      19.599     0.999512        49933         0.00
      19.775     0.999561        49936 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      19.823     0.999609        49938         0.00
      20.015     0.999658        49940        -0.00
      20.351     0.999707        49943        -0.00
      20.895     0.999756        49945         0.00
      21.135     0.999780        49947 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      21.263     0.999805        49948         -nan
      21.551     0.999829        49949        -0.00
      21.743     0.999854        49950        -0.00
      22.463     0.999878        49951         0.00
      22.783     0.999890        49952 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      23.071     0.999902        49953         -nan
      23.071     0.999915        49953        -0.00
      23.231     0.999927        49954        -0.00
      23.231     0.999939        49954         0.00
      23.791     0.999945        49955 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      23.791     0.999951        49955         0.00
      23.791     0.999957        49955        -0.00
      24.079     0.999963        49956        -0.00
      24.079     0.999969        49956         0.00
      24.079     0.999973        49956 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      24.079     0.999976        49956         0.00
      24.079     0.999979        49956        -0.00
      25.359     0.999982        49957        -0.00
      25.359     1.000000        49957         0.00
#[Mean    =        2.077, StdDeviation   =        1.712]
#[Max     =       25.344, Total count    =        49957]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59976 requests in 1.00m, 5.05MB read
Requests/sec:    999.78
Transfer/sec:     86.21KB